#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.private_key: Refreshing state... [id=d754f6935d14c1f4232b032301504bc393aadd58]
linode_nodebalancer.app_nb: Refreshing state... [id=187430]
acme_registration.reg: Refreshing state... [id=https://acme-staging-v02.api.letsencrypt.org/acme/acct/38901228]
linode_domain.domain: Refreshing state... [id=1770679]
linode_instance.app[0]: Refreshing state... [id=33347906]
linode_instance.db: Refreshing state... [id=33347907]
acme_certificate.certificate: Refreshing state... [id=b5d7a82d-eeb7-3de1-c2a0-42bc67fe29d8]
linode_nodebalancer_config.app_nb_config: Refreshing state... [id=267265]
linode_nodebalancer_node.app_nb_node[0]: Refreshing state... [id=38064876]
linode_domain_record.rewards: Refreshing state... [id=19849463]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # linode_nodebalancer.app_nb has changed
  ~ resource "linode_nodebalancer" "app_nb" {
        id                   = "187430"
        tags                 = [
            "fealty",
        ]
      ~ transfer             = [
          ~ {
              ~ in    = 0 -> 0.02599620819091797
              ~ out   = 0 -> 0.04278373718261719
              ~ total = 0 -> 0.06877994537353516
            },
        ]
        # (8 unchanged attributes hidden)
    }

  # linode_nodebalancer_config.app_nb_config has changed
  ~ resource "linode_nodebalancer_config" "app_nb_config" {
        id              = "267265"
      ~ node_status     = [
          ~ {
              ~ up   = 0 -> 1
                # (1 unchanged element hidden)
            },
        ]
        # (18 unchanged attributes hidden)
    }

  # linode_nodebalancer_node.app_nb_node[0] has changed
  ~ resource "linode_nodebalancer_node" "app_nb_node" {
        id              = "38064876"
      ~ status          = "Unknown" -> "UP"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # linode_firewall.fealty_fw[0] will be created
  + resource "linode_firewall" "fealty_fw" {
      + devices         = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + inbound_policy  = "DROP"
      + label           = "fealty_fw"
      + linodes         = (known after apply)
      + outbound_policy = "ACCEPT"
      + status          = (known after apply)
      + tags            = [
          + "fealty",
        ]
    }

  # linode_instance.app[0] must be replaced
-/+ resource "linode_instance" "app" {
      ~ backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> (known after apply)
      ~ boot_config_label  = "My fealty-app Profile" -> (known after apply)
      ~ id                 = "33347906" -> (known after apply)
      ~ image              = "private/15094077" -> "dummy" # forces replacement
      ~ ip_address         = "170.187.148.179" -> (known after apply)
      ~ ipv4               = [
          - "170.187.148.179",
          - "192.168.192.76",
        ] -> (known after apply)
      ~ ipv6               = "2600:3c02::f03c:92ff:fea4:6fc0/128" -> (known after apply)
      ~ private_ip_address = "192.168.192.76" -> (known after apply)
      ~ specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "fealty",
        ]
        # (8 unchanged attributes hidden)

      ~ alerts {
          ~ cpu            = 90 -> (known after apply)
          ~ io             = 10000 -> (known after apply)
          ~ network_in     = 10 -> (known after apply)
          ~ network_out    = 10 -> (known after apply)
          ~ transfer_quota = 80 -> (known after apply)
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-app Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67163221 -> null
                  - disk_label = "fealty-app" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67163222 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - purpose = "public" -> null
            }
          - interface {
              - ipam_address = "10.10.10.2/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67163221 -> null
          - label            = "fealty-app" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67163222 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

      ~ interface {
            # (1 unchanged attribute hidden)
        }
      ~ interface {
          ~ label        = "fealty-vlan" -> "fealty_vlan"
            # (2 unchanged attributes hidden)
        }
    }

  # linode_instance.db must be replaced
-/+ resource "linode_instance" "db" {
      ~ backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> (known after apply)
      ~ boot_config_label  = "My fealty-db Profile" -> (known after apply)
      ~ id                 = "33347907" -> (known after apply)
      ~ image              = "private/15094078" -> "dummy" # forces replacement
      ~ ip_address         = "170.187.148.194" -> (known after apply)
      ~ ipv4               = [
          - "170.187.148.194",
        ] -> (known after apply)
      ~ ipv6               = "2600:3c02::f03c:92ff:fea4:6f9f/128" -> (known after apply)
      - private_ip         = false -> null
      + private_ip_address = (known after apply)
      ~ specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "fealty",
        ]
        # (6 unchanged attributes hidden)

      ~ alerts {
          ~ cpu            = 90 -> (known after apply)
          ~ io             = 10000 -> (known after apply)
          ~ network_in     = 10 -> (known after apply)
          ~ network_out    = 10 -> (known after apply)
          ~ transfer_quota = 80 -> (known after apply)
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-db Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67163223 -> null
                  - disk_label = "fealty-db" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67163224 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - ipam_address = "10.10.10.3/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67163223 -> null
          - label            = "fealty-db" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67163224 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

      ~ interface {
          ~ label        = "fealty-vlan" -> "fealty_vlan"
            # (2 unchanged attributes hidden)
        }
    }

  # linode_nodebalancer_config.app_nb_config will be updated in-place
  ~ resource "linode_nodebalancer_config" "app_nb_config" {
      ~ algorithm       = "source" -> "leastconn"
        id              = "267265"
        # (18 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ DB_Private_IP = [
      - "10.10.10.3/24",
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @biodrone, Action: `pull_request`, Working Directory: `deploy`, Workflow: `CI`*